src/DataProcessors/ОбработкаКанбанныхПозиций/ОбработкаКанбанныхПозиций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ОбработкаКанбанныхПозиций</name>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>Пометка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.СтатусыСпецификаций</types>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПроизводство</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПроизводствоКЗ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДолг</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДолгПоКЗ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоОстаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЗапустить</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/AccumulationRegisters/ЗаказыНаПроизводство/ЗаказыНаПроизводство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗаказыНаПроизводство</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/Долги/Долги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Долги</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/DataProcessors/ОбработкаКанбанныхПозиций/Forms/Форма/Module.bsl
&НаСервере
Функция ПолучитьСпецификации(Товар)
СписокСпецификаций = Новый СписокЗначений;
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка,
	|	СтатусыМПЗСрезПоследних.Статус КАК Статус
	|ИЗ
	|	РегистрСведений.СтатусыМПЗ.СрезПоследних(&НаДату, ) КАК СтатусыМПЗСрезПоследних
	|		ПОЛНОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО СтатусыМПЗСрезПоследних.МПЗ = Номенклатура.Ссылка
	|ГДЕ
	|	Номенклатура.Товар = &Товар
	|	И СтатусыМПЗСрезПоследних.Статус <> &Статус";
	Если СписокЛинеек.Количество() > 0 Тогда	
	Запрос.Текст = Запрос.Текст + " И Номенклатура.Линейка В ИЕРАРХИИ(&СписокЛинеек)";
	Запрос.УстановитьПараметр("СписокЛинеек",СписокЛинеек);
	КонецЕсли; 
Запрос.УстановитьПараметр("Товар",Товар);
Запрос.УстановитьПараметр("Статус",Перечисления.СтатусыСпецификаций.Запрещённая);
Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
РезультатЗапроса = Запрос.Выполнить();
Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Найти(Выборка.Ссылка.Наименование,"_КА") = 0 Тогда
			Если Выборка.Статус = Перечисления.СтатусыСпецификаций.ДоИсчерпанияЗапасов Тогда
			СписокСпецификаций.Вставить(0,Выборка.Ссылка);
			Иначе
			СписокСпецификаций.Добавить(Выборка.Ссылка,СокрЛП(Выборка.Ссылка.Наименование)+" ["+Выборка.Статус+"]");
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
Возврат(СписокСпецификаций);
КонецФункции

&НаСервере
Функция ПолучитьКоличествоВПроизводстве(Продукция)
Запрос = Новый Запрос;
СписокСК = Новый СписокЗначений;

СписокСК.Добавить(Справочники.СтандартныеКомментарии.НайтиПоНаименованию("Крупный заказ",Истина));
СписокСК.Добавить(Справочники.СтандартныеКомментарии.НайтиПоНаименованию("Крупный заказ последний",Истина));

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПланыВыпускаОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ПланыВыпуска.Остатки КАК ПланыВыпускаОстатки
	|ГДЕ
	|	ПланыВыпускаОстатки.Номенклатура = &Номенклатура
	|	И НЕ ПланыВыпускаОстатки.МаршрутнаяКарта.СтандартныйКомментарий В (&СписокСтандартныхКомментариев)
	|	И ПланыВыпускаОстатки.МаршрутнаяКарта.СтандартныйКомментарий.НеВыгружать = ЛОЖЬ"; 
Запрос.УстановитьПараметр("Номенклатура", Продукция);
Запрос.УстановитьПараметр("СписокСтандартныхКомментариев", СписокСК);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
Количество = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Количество = Количество + ВыборкаДетальныеЗаписи.КоличествоОстаток;
	КонецЦикла;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВыпускПродукцииПоступление.Количество КАК Количество
	|ИЗ
	|	Документ.ВыпускПродукции.Поступление КАК ВыпускПродукцииПоступление
	|ГДЕ
	|	ВыпускПродукцииПоступление.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	И ВыпускПродукцииПоступление.Номенклатура = &Номенклатура
	|	И НЕ ВыпускПродукцииПоступление.Ссылка.ДокументОснование.ДокументОснование.СтандартныйКомментарий В (&СписокСтандартныхКомментариев)
	|	И ВыпускПродукцииПоступление.Ссылка.ДокументОснование.Выгружено = ЛОЖЬ
	|	И ВыпускПродукцииПоступление.Ссылка.ДокументОснование.СтандартныйКомментарий.НеВыгружать = ЛОЖЬ"; 
Запрос.УстановитьПараметр("ДатаНач", Дата(2019,1,1,0,0,0));
Запрос.УстановитьПараметр("ДатаКон", ТекущаяДата());
Запрос.УстановитьПараметр("Номенклатура", Продукция);
Запрос.УстановитьПараметр("СписокСтандартныхКомментариев", СписокСК);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Количество = Количество + ВыборкаДетальныеЗаписи.Количество;
	КонецЦикла;
Возврат(Количество);
КонецФункции

&НаСервере
Функция ПолучитьКоличествоВПроизводствеКЗ(Продукция)
Запрос = Новый Запрос;
СписокСК = Новый СписокЗначений;

СписокСК.Добавить(Справочники.СтандартныеКомментарии.НайтиПоНаименованию("Крупный заказ",Истина));
СписокСК.Добавить(Справочники.СтандартныеКомментарии.НайтиПоНаименованию("Крупный заказ последний",Истина));

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПланыВыпускаОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ПланыВыпуска.Остатки КАК ПланыВыпускаОстатки
	|ГДЕ
	|	ПланыВыпускаОстатки.Номенклатура = &Номенклатура
	|	И ПланыВыпускаОстатки.МаршрутнаяКарта.СтандартныйКомментарий В(&СписокСтандартныхКомментариев)"; 
Запрос.УстановитьПараметр("Номенклатура", Продукция);
Запрос.УстановитьПараметр("СписокСтандартныхКомментариев", СписокСК);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
Количество = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Количество = Количество + ВыборкаДетальныеЗаписи.КоличествоОстаток;
	КонецЦикла;

//Запрос.Текст = 
//	"ВЫБРАТЬ
//	|	ВыпускПродукцииПоступление.Количество КАК Количество
//	|ИЗ
//	|	Документ.ВыпускПродукции.Поступление КАК ВыпускПродукцииПоступление
//	|ГДЕ
//	|	ВыпускПродукцииПоступление.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
//	|	И ВыпускПродукцииПоступление.Номенклатура = &Номенклатура
//	|   И ВыпускПродукцииПоступление.Ссылка.ДокументОснование.ДокументОснование.СтандартныйКомментарий В(&СписокСтандартныхКомментариев)
//	|	И ВыпускПродукцииПоступление.Ссылка.ДокументОснование.Выгружено = ЛОЖЬ";
//Запрос.УстановитьПараметр("ДатаНач", Дата(2019,8,30,0,0,0));
//Запрос.УстановитьПараметр("ДатаКон", ТекущаяДата()); 
//Запрос.УстановитьПараметр("Номенклатура", Продукция);
//Запрос.УстановитьПараметр("СписокСтандартныхКомментариев", СписокСК);
//РезультатЗапроса = Запрос.Выполнить();
//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//	Количество = Количество + ВыборкаДетальныеЗаписи.Количество;
//	КонецЦикла;
Возврат(Количество);
КонецФункции

&НаСервере
Функция ПолучитьКоличествоДолгПоКЗ(Продукция)
Запрос = Новый Запрос;
СписокСК = Новый СписокЗначений;

СписокСК.Добавить(Справочники.СтандартныеКомментарии.НайтиПоНаименованию("Крупный заказ",Истина));
СписокСК.Добавить(Справочники.СтандартныеКомментарии.НайтиПоНаименованию("Крупный заказ последний",Истина));

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПланыВыпускаОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ПланыВыпуска.Остатки КАК ПланыВыпускаОстатки
	|ГДЕ
	|	ПланыВыпускаОстатки.Номенклатура = &Номенклатура
	|	И ПланыВыпускаОстатки.МаршрутнаяКарта.СтандартныйКомментарий В(&СписокСтандартныхКомментариев)"; 
Запрос.УстановитьПараметр("Номенклатура", Продукция);
Запрос.УстановитьПараметр("СписокСтандартныхКомментариев", СписокСК);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
Количество = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Количество = Количество + ВыборкаДетальныеЗаписи.КоличествоОстаток;
	КонецЦикла;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказыНаПроизводствоОстатки.Документ КАК Документ,
	|	ЗаказыНаПроизводствоОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ЗаказыНаПроизводство.Остатки КАК ЗаказыНаПроизводствоОстатки
	|ГДЕ
	|	ЗаказыНаПроизводствоОстатки.Продукция = &Продукция";
Запрос.УстановитьПараметр("Продукция",Продукция);	
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	ТЧ_Заказ = ВыборкаДетальныеЗаписи.Документ.Заказ.Найти(Продукция,"Продукция");
		Если ТЧ_Заказ <> Неопределено Тогда
			Если ТЧ_Заказ.РучнойЗапуск = 0 Тогда
				Если ТЧ_Заказ.КрупныйЗаказ Тогда
				Количество = Количество + ТЧ_Заказ.Количество - ПолучитьКоличествоСозданых(ВыборкаДетальныеЗаписи.Документ,Продукция);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
Возврат(Количество);
КонецФункции

&НаСервере
Функция ПолучитьКоличествоДолг(Продукция)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДолгиОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.Долги.Остатки КАК ДолгиОстатки
	|ГДЕ
	|	ДолгиОстатки.Продукция = &Продукция"; 
Запрос.УстановитьПараметр("Продукция", Продукция);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
Количество = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Количество = Количество + ВыборкаДетальныеЗаписи.КоличествоОстаток;
	КонецЦикла;
Возврат(Количество);
КонецФункции

&НаСервере
Функция ПолучитьКоличествоОстаток(Продукция)
Запрос = Новый Запрос;
СписокМестХранения = Новый СписокЗначений;

СписокМестХранения.Добавить(Константы.МестоХраненияТранзит.Получить());
	Если ТипЗнч(Продукция) = Тип("СправочникСсылка.Номенклатура") Тогда
	СписокМестХранения.Добавить(Продукция.Линейка.МестоХраненияГП);
	Иначе
	Константы.МестоХраненияГПТНП.Получить();	
	КонецЕсли; 
Запрос.Текст = 
	"ВЫБРАТЬ
	|	МестаХраненияОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.МестаХранения.Остатки КАК МестаХраненияОстатки
	|ГДЕ
	|	МестаХраненияОстатки.МестоХранения В(&СписокМестХранения)
	|	И МестаХраненияОстатки.МПЗ = &МПЗ"; 
Запрос.УстановитьПараметр("СписокМестХранения", СписокМестХранения);
Запрос.УстановитьПараметр("МПЗ", Продукция);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
Количество = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Количество = Количество + ВыборкаДетальныеЗаписи.КоличествоОстаток;
	КонецЦикла;
Возврат(Количество);
КонецФункции

&НаСервере
Процедура ПолучитьКанбанныеПозицииНаСервере()
Объект.ТабличнаяЧасть.Очистить();
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	Товары.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Товары КАК Товары
	|ГДЕ
	|	Товары.ПометкаУдаления = ЛОЖЬ
	|	И Товары.Канбан = ИСТИНА
	|
	|УПОРЯДОЧИТЬ ПО
	|	Товары.Наименование";
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	СписокСпецификаций = ПолучитьСпецификации(ВыборкаДетальныеЗаписи.Ссылка);
		Для каждого Спецификация Из СписокСпецификаций Цикл
		КоличествоДолгПоКЗ = ПолучитьКоличествоДолгПоКЗ(Спецификация.Значение);
		ТЧ = Объект.ТабличнаяЧасть.Добавить();
		ТЧ.Товар = ВыборкаДетальныеЗаписи.Ссылка;
		ТЧ.Статус = ПолучитьСтатус(Спецификация.Значение);	
		ТЧ.Продукция = Спецификация.Значение;
		ТЧ.КоличествоПроизводство = ПолучитьКоличествоВПроизводстве(ТЧ.Продукция);
		ТЧ.КоличествоПроизводствоКЗ = ПолучитьКоличествоВПроизводствеКЗ(ТЧ.Продукция);
		ТЧ.КоличествоДолг = ПолучитьКоличествоДолг(Спецификация.Значение) - КоличествоДолгПоКЗ;
		ТЧ.КоличествоДолгПоКЗ = КоличествоДолгПоКЗ;
		ТЧ.КоличествоОстаток = ПолучитьКоличествоОстаток(Спецификация.Значение);
		Количество = ТЧ.КоличествоОстаток + ТЧ.КоличествоПроизводство - ТЧ.КоличествоДолг;
			Если Количество >= ТЧ.Товар.КратностьЗапуска Тогда
			ТЧ.КоличествоЗапустить = 0;
			Иначе
			ТЧ.КоличествоЗапустить = ТЧ.Товар.КратностьЗапуска - Количество;
			КонецЕсли;
		КонецЦикла; 
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьКанбанныеПозиции(Команда)
ПолучитьКанбанныеПозицииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьПродукцияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;
СписокСпецификаций = ПолучитьСпецификации(Элементы.ТабличнаяЧасть.ТекущиеДанные.Товар);
Продукция = СписокСпецификаций.ВыбратьЭлемент("Выберите продукцию");
	Если Продукция <> Неопределено Тогда	
	Элементы.ТабличнаяЧасть.ТекущиеДанные.Продукция = Продукция.Значение;	
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура СоздатьМТКНаСервере()
СтандартныйКомментарий = Справочники.СтандартныеКомментарии.НайтиПоНаименованию("Изделия на пополнение склада ГП",Истина);
	Для каждого ТЧ Из Объект.ТабличнаяЧасть Цикл	
		Если ТЧ.Пометка Тогда
			Если Не ТЧ.Продукция.Линейка.Пустая() Тогда
				Пока ТЧ.КоличествоЗапустить > 0 Цикл
					Если ТЧ.КоличествоЗапустить > ТЧ.Товар.КратностьЗапуска Тогда
					Количество = ТЧ.Товар.КратностьЗапуска;
					Иначе
					Количество = ТЧ.КоличествоЗапустить;				
					КонецЕсли; 
				МТК = ОбщийМодульСозданиеДокументов.СоздатьМТК(ТЧ.Продукция.Линейка,ТЧ.Продукция,Количество,СтандартныйКомментарий,Справочники.Проекты.ПустаяСсылка());
					Если Не МТК.Пустая() Тогда
					ТЧ.КоличествоЗапустить = ТЧ.КоличествоЗапустить - Количество;	
					Иначе
					Сообщить(СокрЛП(ТЧ.Продукция.Наименование)+" - МТК не создана!");
					Прервать;
					КонецЕсли; 
				КонецЦикла;
			КонецЕсли;
		КонецЕсли; 
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура СоздатьМТК(Команда)
СоздатьМТКНаСервере();
КонецПроцедуры
